#### **Ejercicio 1: Creación y manipulación de Series**
1. Crea una Serie que contenga las ventas de una tienda de lunes a viernes. Utiliza las siguientes cantidades:
   - Lunes: 100
   - Martes: 150
   - Miércoles: 200
   - Jueves: 50
   - Viernes: 300
   
2. Realiza las siguientes operaciones sobre la Serie:
   - Accede al valor de las ventas del miércoles.
   - Calcula el total de ventas de la semana.
   - Filtra los días donde las ventas fueron mayores a 100.

In [6]:
import pandas as pd

# Crear una Serie a partir de una lista
mi_serie = pd.Series({'Lunes':100,'Martes' : 150,'Miércoles':200, 'Jueves': 50, 'Viernes': 300 })
print(mi_serie)

<bound method Series.sum of Lunes        100
Martes       150
Miércoles    200
Jueves        50
Viernes      300
dtype: int64>

In [4]:
print(mi_serie['Miércoles'])

200

In [8]:
suma_total = mi_serie.sum()

print("La suma total es:", suma_total)

La suma total es: 800

In [13]:
print(mi_serie[mi_serie > 100])

Martes       150
Miércoles    200
Viernes      300
dtype: int64

#### **Ejercicio 2: Creación y análisis de un DataFrame**
1. Crea un DataFrame que contenga los nombres y edades de las siguientes personas:
   - Ana, 23 años
   - Luis, 35 años
   - María, 29 años
   
2. Realiza las siguientes operaciones sobre el DataFrame:
   - Accede a la columna de los nombres.
   - Filtra las filas donde la edad sea mayor a 25.
   - Agrega una nueva columna con los salarios de las personas (Ana: 30000, Luis: 45000, María: 35000).

In [21]:
import pandas as pd

df = pd.DataFrame({
    'Nombre': ['Ana', 'Luis', 'María'],
    'Edad': [23, 35, 29]
})

In [22]:
df

  Nombre  Edad
0    Ana    23
1   Luis    35
2  María    29

In [23]:
df['Nombre']

0      Ana
1     Luis
2    María
Name: Nombre, dtype: object

In [28]:
print(df[df['Edad']>25])

  Nombre  Edad
1   Luis    35
2  María    29

In [33]:
salarios = {'Ana': 30000, 'Luis': 45000, 'María': 35000}

df['Salarios'] = df['Nombre'].map(salarios)

In [34]:
df

  Nombre  Edad  Salarios
0    Ana    23     30000
1   Luis    35     45000
2  María    29     35000

#### **Ejercicio 3: Cálculos con DataFrames**
1. Crea un DataFrame con información de ventas de productos en una tienda:
   - Productos: "Laptop", "Mouse", "Teclado"
   - Ventas: 30, 120, 75
   - Precio por unidad: 1000, 50, 80

2. Calcula:
   - La venta total para cada producto (multiplicando el precio por unidad por las ventas).
   - El total de ingresos para todos los productos.

In [43]:
df_tienda = pd.DataFrame({
    'Productos': ['Laptop', 'Mouse', 'Teclado'],
    'Ventas': [30, 120, 75],
    'Precio': [1000,50,80]
})

In [45]:
df_tienda

  Productos  Ventas  Precio
0    Laptop      30    1000
1     Mouse     120      50
2   Teclado      75      80

In [39]:
def ventas_por_producto(df_tienda):
    for i in range(len(df_tienda)):
        print('Ventas para', df_tienda['Productos'][i], '=', df_tienda['Ventas'][i] * df_tienda['Precio'][i])

ventas_por_producto(df_tienda)

Ventas para Laptop = 30000
Ventas para Mouse = 6000
Ventas para Teclado = 6000

In [44]:
################## otra solucion sin funciones, y para que la salida sea
ventas_totales = df_tienda['Ventas'] * df_tienda['Precio']

resultado = pd.DataFrame({'Productos': df_tienda['Productos'], 'Ventas Totales': ventas_totales})

print(resultado)

  Productos  Ventas Totales
0    Laptop           30000
1     Mouse            6000
2   Teclado            6000

In [49]:
print(ventas_totales.sum())

42000

#### **Ejercicio 4: Transformación y limpieza de datos en DataFrames**
1. Crea un DataFrame con información de estudiantes y sus calificaciones en tres materias:
   - Estudiantes: "Ana", "Luis", "María", "Carlos"
   - Matemáticas: 90, 85, None, 78
   - Ciencia: 88, 92, 85, None
   - Historia: 75, None, 80, 90

2. Realiza las siguientes operaciones:
   - Rellena los valores faltantes con la media de cada columna.
   - Renombra las columnas de las materias en inglés (Math, Science, History).
   - Calcula la calificación promedio de cada estudiante.

In [64]:
df_estudiantes = pd.DataFrame({
    'Estudiantes': ["Ana", "Luis", "María", "Carlos"],
    'Matemáticas': [90, 85, None, 78],
    'Ciencia': [88, 92, 85, None],
    'Historia':[75, None, 80, 90]
})
df_estudiantes

  Estudiantes  Matemáticas  Ciencia  Historia
0         Ana         90.0     88.0      75.0
1        Luis         85.0     92.0       NaN
2       María          NaN     85.0      80.0
3      Carlos         78.0      NaN      90.0

In [65]:
df_estudiantes[['Matemáticas', 'Ciencia', 'Historia']] = df_estudiantes[['Matemáticas', 'Ciencia', 'Historia']].fillna(df_estudiantes[['Matemáticas', 'Ciencia', 'Historia']].mean())

In [66]:
df_estudiantes

  Estudiantes  Matemáticas    Ciencia   Historia
0         Ana    90.000000  88.000000  75.000000
1        Luis    85.000000  92.000000  81.666667
2       María    84.333333  85.000000  80.000000
3      Carlos    78.000000  88.333333  90.000000

In [77]:
df_estudiantes.rename(columns = {
    'Matemáticas':'Math',
    'Ciencia':'Science',
    'Historia':'History'
}, inplace=True)

In [78]:
df_estudiantes

  Estudiantes       Math    Science    History
0         Ana  90.000000  88.000000  75.000000
1        Luis  85.000000  92.000000  81.666667
2       María  84.333333  85.000000  80.000000
3      Carlos  78.000000  88.333333  90.000000

In [82]:
promedio = df_estudiantes[['Math', 'Science', 'History']].mean(axis=1)

print(promedio)

0    84.333333
1    86.222222
2    83.111111
3    85.444444
dtype: float64